In [10]:
import numpy as np

In [11]:
import pandas as pd

In [12]:
from pandas import Series, DataFrame

In [13]:
ser1 = Series(np.arange(3),index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int32

In [14]:
ser1 = 2*ser1

In [15]:
ser1

A    0
B    2
C    4
dtype: int32

In [16]:
ser1['B']

2

In [17]:
ser1[1]
#the index numerical value, A is 0, B is 1...

2

In [18]:
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [19]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [20]:
#bolean logic
ser1[ser1>3]
#grab everywhere that the series is greater than 3

C    4
dtype: int32

In [21]:
ser1[ser1>3] = 10

In [22]:
ser1

A     0
B     2
C    10
dtype: int32

In [23]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],
                   columns=['A','B','C','D','E'])

In [24]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [25]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [27]:
#to select multiple colomns or rows, use two pairt of brackets
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [28]:
dframe[dframe['C']>8]
#send back all that D column is greater than 8

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [29]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [30]:
dframe > 10
#boolean dataframe, yes then true, otherwise false

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [33]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [39]:
dframe.loc['NYC']

A    0
B    1
C    2
D    3
E    4
Name: NYC, dtype: int32

In [34]:
dframe.loc['DC']

A    15
B    16
C    17
D    18
E    19
Name: DC, dtype: int32

In [ ]:
#for columns, just use dframe['A'], for index, use dframe.loc['A']